app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
    def authenticate_user
    if session[:user_id]
        # set current user object to @current_user object variable
        @current_user = User.find session[:user_id]