app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if(@article.save)
---
INSERT INTO `articles` (`title`, `text`, `created_at`, `updated_at`) VALUES ('second', 'this is the second article', '2020-04-25 14:36:18.607925', '2020-04-25 14:36:18.607925')

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`text` = 'hello from rails2', `articles`.`updated_at` = '2020-04-26 02:03:14.509645' WHERE `articles`.`id` = 1