app/controllers/comments_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1 AND `comments`.`id` = 2 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 3
---
    def destroy
        @article = Article.find(params[:article_id])
        @comment = @article.comments.find(params[:id] )
        @comment.destroy