app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `username`, `email`, `encrypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('ramzy', 'ramzy', 'ramzy@yahoo.com', '$2a$12$zuQY1IJTbazwHzAwUMKlQ.Gi5YvwADwTB/gP.I5H9i/rbC5/hR0YW', '$2a$12$zuQY1IJTbazwHzAwUMKlQ.', '2020-04-25 22:31:24.895404', '2020-04-25 22:31:24.895404')